Environmental Applications/AIJ - Case D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "4";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            timeVaryingMappedFixedValue;
        offset          constant (0 0 0);
        value           nonuniform List<vector> 
8550
(
(-0.007 0 -3.0823)
(-0.007 0 -3.0823)
(-0.007 0 -3.0823)
(-0.007 0 -3.0823)
(-0.007 0 -3.0823)
(-0.007 0 -3.0823)
(-0.007 0 -3.0823)
(-0.007 0 -3.0823)
...
)
;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    lid
    {
        type            symmetry;
    }
    rc
    {
        type            noSlip;
    }
    wallup
    {
        type            symmetry;
    }
    walldown
    {
        type            symmetry;
    }
    cylinder
    {
        type            noSlip;
    }
}


// ************************************************************************* //
