Environmental Applications/AIJ - Case D/system/probesAIJD
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

type            probes;
libs            (sampling);
writeControl    runTime;
writeInterval   0.001;

fields
(
    U
);

probeLocations
(
(	1.7625	0.9625	0.005	)
(	1.7625	0.8375	0.005	)
(	1.7875	0.9625	0.005	)
(	1.7875	0.8375	0.005	)
(	1.8125	1.0125	0.005	)
(	1.8125	0.9875	0.005	)
(	1.8125	0.9625	0.005	)
(	1.8125	0.9375	0.005	)
(	1.8125	0.9125	0.005	)
(	1.8125	0.8875	0.005	)
(	1.8125	0.8625	0.005	)
(	1.8125	0.8375	0.005	)
(	1.8125	0.8125	0.005	)
(	1.8125	0.7875	0.005	)
(	1.8375	1.0125	0.005	)
(	1.8375	0.9875	0.005	)
(	1.8375	0.9625	0.005	)
(	1.8375	0.9375	0.005	)
(	1.8375	0.9125	0.005	)
(	1.8375	0.8875	0.005	)
(	1.8375	0.8625	0.005	)
(	1.8375	0.8375	0.005	)
(	1.8375	0.8125	0.005	)
(	1.8375	0.7875	0.005	)
(	1.8625	0.9625	0.005	)
(	1.8625	0.9375	0.005	)
(	1.8625	0.9125	0.005	)
(	1.8625	0.8875	0.005	)
(	1.8625	0.8625	0.005	)
(	1.8625	0.8375	0.005	)
(	1.8875	0.9625	0.005	)
(	1.8875	0.9375	0.005	)
(	1.8875	0.8625	0.005	)
(	1.8875	0.8375	0.005	)
(	1.9125	0.9625	0.005	)
(	1.9125	0.9375	0.005	)
(	1.9125	0.8625	0.005	)
(	1.9125	0.8375	0.005	)
(	1.9375	0.9625	0.005	)
(	1.9375	0.9375	0.005	)
(	1.9375	0.9125	0.005	)
(	1.9375	0.8875	0.005	)
(	1.9375	0.8625	0.005	)
(	1.9375	0.8375	0.005	)
(	1.9625	1.0125	0.005	)
(	1.9625	0.9875	0.005	)
(	1.9625	0.9625	0.005	)
(	1.9625	0.9375	0.005	)
(	1.9625	0.9125	0.005	)
(	1.9625	0.8875	0.005	)
(	1.9625	0.8625	0.005	)
(	1.9625	0.8375	0.005	)
(	1.9625	0.8125	0.005	)
(	1.9625	0.7875	0.005	)
(	1.9875	1.0125	0.005	)
(	1.9875	0.9875	0.005	)
(	1.9875	0.9625	0.005	)
(	1.9875	0.9375	0.005	)
(	1.9875	0.9125	0.005	)
(	1.9875	0.8875	0.005	)
(	1.9875	0.8625	0.005	)
(	1.9875	0.8375	0.005	)
(	1.9875	0.8125	0.005	)
(	1.9875	0.7875	0.005	)
(	2.0125	1.0125	0.005	)
(	2.0125	0.9875	0.005	)
(	2.0125	0.9625	0.005	)
(	2.0125	0.9375	0.005	)
(	2.0125	0.9125	0.005	)
(	2.0125	0.8875	0.005	)
(	2.0125	0.8625	0.005	)
(	2.0125	0.8375	0.005	)
(	2.0125	0.8125	0.005	)
(	2.0125	0.7875	0.005	)
(	2.0375	0.9625	0.005	)
(	2.0375	0.8375	0.005	)
(	2.0625	0.9625	0.005	)
(	2.0625	0.8375	0.005	)
	
);

// ************************************************************************* //
